Repository: vareversat/chabo-app
Catalog: lib/l10n/app_*.arb
Languages: es, fr

source: at
es: a las
fr: à

source: and
es: y
fr: et

# the
source: {startWithVowel, select, true{the } other{the }}
es: {startWithVowel, select, true{el } other{el }}
fr: {startWithVowel, select, true{l'} other{le }}

# circulationClosing
source: closing
es: cerrado
fr: fermeture

# circulationReOpening
source: re opening
es: reapertura
fr: réouverture

# isClosed
source: closed to traffic
es: está cerrado al tráfico

source: good afternoon
es: buenas tardes
fr: bonne après-midi

source: good evening
es: buenas noches
fr: bonsoir

source: good morning
es: buenos días
fr: bonjour

# nextClosingScheduled
source: next closing scheduled in
es: próximo cierre programado en
fr: prochaine fermeture prévue dans

# isOpen
source: open to traffic
es: está abierto al tráfico

# scheduledToOpen
source: scheduled to open in
es: programado para abrir en
fr: ouverture prévue dans

# willSoonClose
source: close to traffic soon
es: cerca del tráfico pronto

# notificationsTitle
source: Notifications
es: Notificaciónes

source: Information
es: Información

# dialogInformationContentThe2
source: from
es: desde
fr: du

# dialogInformationContentFromStart
source: from
es: desde
fr: de

# dialogInformationContentFromEnd
source: to
es: hasta
fr: à

# dialogInformationContentFromEnd2
source: to
es: a
fr: au

# dialogInformationContentBridge_closed
source: the Chaban bridge will be closed for
es: el puente Chaban estará cerrado por
fr: le pont Chaban sera fermé pour

# dialogInformationContentBridgeDeparture
source: the departure of the {count, plural, =1 {the} other {the}}
es: la salida {count, plural, =1 {del} other {de los}}
fr: le départ du

# dialogInformationContentBridgeArrival
source: the arrival of {count, plural, =1 {the} other {the}}
es: la llegada {count, plural, =1 {del} other {de los}}
fr: l'arrivée du

# dialogInformationContentBridge_closed_maintenance
source: maintenance
es: mantenimiento

# dialogInformationContentTime_of_crossing
source: estimated time of crossing
es: hora estimada de cruce
fr: heure de passage estimée

# errorScreenContentMessage
source: An error occurred while opening this page. Please find technical information below
es: Se produjo un error al abrir esta página. Encuentre la información técnica a continuación
fr: Une erreur est survenue lors de l'ouverture de cette page. Veuillez trouver les informations techniques ci-dessous

# errorScreenContentTechnical_Info
source: Technical information
es: Información técnica
fr: Informations techniques

# unableAppInfo
source: Unable to get application information
es: No se puede obtener información de la aplicación
fr: Impossible d'obtenir les informations de l'application

# appDescription
source: The Mobile app to get the closing and opening schedules of the Chaban Delmas bridge located in Bordeaux, France
es: La aplicación móvil para obtener los horarios de cierre y apertura del puente Chaban Delmas ubicado en Bordeaux, Francia
fr: L'application Mobile pour connaître les horaires de fermeture et d'ouverture du pont Chaban Delmas situé à Bordeaux, France

source: Changelog
es: Registro de cambios
fr: Journal des modifications

source: Information about the app
es: Información sobre la aplicación
fr: Informations concernant l'application

source: About
es: Acerca de
fr: À propos

# disclaimer
source: Disclaimer: provisional closures. Subject to confirmation from the Harbor Master's Office.
es: Descargo de responsabilidad: cierres provisionales. Sujeto a confirmación de la Capitanía de Puerto.
fr: Avis de non-responsabilité : fermetures provisoires. Sous réserve de confirmation de la Capitainerie.

# openSetting
source: Settings
es: Ajustes

# themeSettingSubtitle
source: Application theme
es: Tema de la aplicación
fr: Choisir le thème de l'application

source: Light theme
es: Tema claro
fr: Thème clair

source: Dark theme
es: Tema oscuro
fr: Thème sombre

source: System theme
es: Tema del sistema
fr: Thème système

source: Notifications
es: Notificaciones

# notificationsSubtitle
source: Manage the notifications of the app
es: Administre las notificaciones de la aplicación
fr: Gérer les notifications de l'application

# durationNotificationTitle
source: {duration}before
es: {duration}antes
fr: {duration}avant

# durationNotificationExplanation
source: Receive a notification {duration}before the next closing. This value also manages the color change of the current status
es: Reciba una notificación {duration}antes del próximo cierre. Este valor también gestiona el cambio de color del estado actual
fr: Recevoir une notification {duration}avant la prochaine fermeture. Cette valeur gère aussi le changement de couleur du statur actuel

# timeNotificationTitle
source: The day before at {time}
es: El día antes a las {time}
fr: La veille à {time}

# timeNotificationExplanation
source: Receive a notification the day before at {time} if a closure is scheduled for the next day
es: Reciba una notificación el día anterior a las {time} si hay un cierre programado para el día siguiente
fr: Recevoir une notification la veille à {time} si une fermeture est prévue le lendemain

# dayNotificationTitle
source: Weekly recap on {day}
es: Resumen semanal el {day}
fr: Récap hebdo le {day}

# dayNotificationExplanation
source: Receive a notification on {day} at {time} listing all planned closures for the coming week
es: Reciba una notificación el {day} a las {time} que enumere todos los cierres planeados para la próxima semana
fr: Recevoir une notification le {day} à {time} listant toutes les fermetures prévues pour la semaine qui arrive

# closingNotificationTitle
source: At closing
es: En el cierre
fr: À la fermeture

# closingNotificationExplanation
source: Receive a notification when the bridge closes
es: Reciba una notificación cuando el puente cierre
fr: Recevoir une notification quand le pont ferme à la circulation

# notificationClosingChannelName
source: Closing
es: Cierre
fr: Fermeture

# notificationClosingTitle
source: The Chaban bridge has closed ⛔
es: El puente Chaban ha cerrado ⛔
fr: Le pont Chaban est fermé ⛔

# notificationClosingBoatMessage
source: The Chaban bridge has just closed for {boat} 🚢. It will remains closed for {duration} 🌉
es: El puente Chaban acaba de cerrarse para {boat} 🚢. Permanecerá cerrado durante {duration} 🌉
fr: Le pont Chaban vient de fermer pour {boat} 🚢. Il restera fermé pendant {duration} 🌉

# notificationClosingMaintenanceMessage
source: The Chaban bridge has just closed for maintenance 🛠. It will remains closed for {duration} 🌉
es: El puente Chaban acaba de cerrarse para mantenimiento 🛠. Permanecerá cerrado durante {duration} 🌉
fr: Le pont Chaban vient de fermer pour maintenance 🛠. Il restera fermé pendant {duration} 🌉

# openingNotificationTitle
source: At the opening
es: En la apertura
fr: À l'ouverture

# openingNotificationExplanation
source: Receive a notification when the bridge open
es: Reciba una notificación cuando el puente abra
fr: Recevoir une notification quand le pont ouvre à la circulation

# notificationOpeningChannelName
source: Opening
es: Apertura
fr: Ouverture

# notificationOpeningTitle
source: The Chaban bridge is open ✅
es: El puente Chaban está abierto ✅
fr: Le pont Chaban est ouvert ✅

# notificationOpeningMessage
source: The Chaban bridge has just opened to traffic 🚲
es: El puente Chaban acaba de abrirse al tráfico 🚲
fr: Le pont Chaban vient de rouvir à la circulation 🚲

source: Monday
es: Lunes
fr: Lundi

source: Tuesday
es: Martes
fr: Mardi

source: Wednesday
es: Miércoles
fr: Mercredi

source: Thursday
es: Jueves
fr: Jeudi

source: Friday
es: Viernes
fr: Vendredi

source: Saturday
es: Sábado
fr: Samedi

source: Sunday
es: Domingo
fr: Dimanche

# notificationDurationTitle
source: Imminent closure ⚠️
es: Cierre inminente ⚠️
fr: Fermeture imminante ⚠️

# notificationDurationBoatMessage
source: The Chaban bridge will close in {timeLeft} for {boat} 🚢. It will remains closed for {duration} 🌉
es: El puente Chaban cerrará en {timeLeft} para {boat} 🚢. Permanecerá cerrado durante {duration} 🌉
fr: Le pont Chaban fermera dans {timeLeft} pour {boat} 🚢. Il restera fermé pendant {duration} 🌉

# notificationDurationMaintenanceMessage
source: The Chaban Bridge will close in {timeLeft} for maintenance 🛠. It will remains closed for {duration} 🌉
es: El puente Chaban cerrará en {timeLeft} para mantenimiento 🛠. Permanecerá cerrado durante {duration} 🌉
fr: Le pont Chaban fermera dans {timeLeft} pour maintenance 🛠. Il restera fermé pendant {duration} 🌉

# notificationDurationChannelName
source: Imminent closures
es: Cierres inminentes
fr: Fermetures imminentes

# notificationTimeTitle
source: 🗓 Closing scheduled for tomorrow
es: 🗓 Cierre programado para mañana
fr: 🗓 Fermeture prévue pour demain

# notificationTimeBoatMessage
source: The Chaban bridge will close tomorrow at {time} for {boat} 🚢. It will remains closed for {duration} 🌉
es: El puente Chaban cerrará mañana a las {time} para {boat} 🚢. Permanecerá cerrado durante {duration} 🌉
fr: Le pont Chaban fermera demain à {time} pour {boat} 🚢. Il restera fermé pendant {duration} 🌉

# notificationTimeBoatArrival
source: the arrival of the {boat}
es: la llegada del {boat}
fr: l'arrivée du {boat}

# notificationTimeBoatDeparture
source: the departure of the {boat}
es: la salida del {boat}
fr: le départ du {boat}

# notificationTimeMaintenanceMessage
source: The Chaban Bridge will close tomorrow at {time} for maintenance 🛠. It will remains closed for {duration} 🌉
es: El puente Chaban cerrará mañana a las {time} por mantenimiento 🛠. Permanecerá cerrado durante {duration} 🌉
fr: Le pont Chaban fermera demain à {time} pour maintenance 🛠. Il restera fermé pendant {duration} 🌉

# notificationTimeChannelName
source: Next day closings
es: Cierres del próximo día
fr: Fermetures du lendemain

# passedClosure
source: Past closure
es: Cierre pasado
fr: Fermeture passée

# selectAboutDialog
source: {choice, select, source_code {Source code} privacy_policy {Privacy policy} yuhliet_instagram {Yuhliet's Instagram} city_of_bordeaux {City of Bordeaux} bordeaux_open_data {Bordeaux Open Data} licenses {Licenses} changelog {Changelog} other {Undefined}}
es: {choice, select, source_code {Código fuente} privacy_policy {Política de privacidad} yuhliet_instagram {Instagram de Yuhliet's} city_of_bordeaux {Ciudad de Bordeaux} bordeaux_open_data {Bordeaux Open Data} licenses {Licencias} changelog {Registro de cambios} other {Undefined}}
fr: {choice, select, source_code {Code source} privacy_policy {Politique de confidentialité} yuhliet_instagram {Instagram de Yuhliet's} city_of_bordeaux {Ville de Bordeaux} bordeaux_open_data {Bordeaux Open Data} changelog {Journal des modifications} licenses {Licences} other {Undefined}}

source: Day
es: Día
fr: Jour

# notificationDayTitle
source: 🔮 Closing scheduled
es: 🔮 Cierre programado
fr: 🔮 Fermetures prévues

# notificationDayMessage
source: {count, plural, =0{No closures scheduled for next week} =1{Next week, the Chaban Delmas bridge will only close once} other{Next week, the Chaban Delmas bridge will close {count} times}}
es: {count, plural, =0{No hay cierres programados para la próxima semana} =1{La próxima semana, el puente Chaban Delmas solo cerrará una vez} other{La próxima semana, el puente Chaban Delmas cerrará {count} veces}}
fr: {count, plural, =0{Aucune fermetures de prévue pour la semaine prochaine} =1{La semaine prochaine, le pont Chaban Delmas ne fermera qu'une seul fois} other{La semaine prochaine, le pont Chaban Delmas fermera à {count} reprises}}

# notificationDayChannelName
source: Planned closures
es: Cierres planificados
fr: Fermetures prévues

source: Left handed
es: Zurdo.a
fr: Gaucher.ère

source: Right handed
es: Diestro.a
fr: Droitier.ère

# statusLoadMessage
source: Loading of the bridge's current status
es: Carga del estado actual del puente
fr: Chargement de l'état actuel du pont

source: Loading...
es: Cargando...
fr: Chargement...

# dayNotificationAt
source: at
es: en las
fr: à

# favoriteSlotsFrom
source: From
es: De
fr: De

# favoriteSlotsTo
source: to
es: a
fr: à

# favoriteSlots
source: My favorite time slots
es: Mis franjas horarias favoritas
fr: Mes créneaux horaires favoris

# favoriteSlotsDescription
source: You can fill in two time slots during which the events of the Chaban bridge are likely to impact you
es: Puede completar dos intervalos de tiempo durante los cuales es probable que los eventos del puente Chaban lo afecten
fr: Vous pouvez renseigner deux créneaux durant lesquels les évènements du pont Chaban risques de vous impacter

# favoriteTimeSlotDefaultName
source: Time slot n°{index}
es: Franja horaria n°{index}
fr: Créneau n°{index}

# favoriteSlotsInterferenceWarning
source: This schedule interferes with one or more time slots
es: Este horario interfiere con uno o más intervalos de tiempo
fr: Cette prévision interfère avec un ou plusieurs créneaux

# favoriteTimeSlotEnabledWarning
source: Attention, by activating this parameter you will only receive notifications when an event occurs during one of your time slots
es: Atención, al activar este parámetro solo recibirás notificaciones cuando ocurra un evento durante una de tus franjas horarias
fr: Attention, en activant ce paramètres vous allez uniquement recevoir les notifications lorsqu'un évèmenent se produit durant l'un de vos créneaux

# favoriteSlotsChooseDay
source: Choose the days of the week
es: Elegir los días de la semana
fr: Choisir les jours de la semaine

# moonHarborStatus
source: {count, plural, =1 {is} other {are}} currently docked in the 'Moon Harbor'
es: {count, plural, =1 {está actualmente amarrado} other {están actualmente amarrados}} en el 'Puerto de la Luna'
fr: {count, plural, =1 {est actuellement amarré} other {sont actuellement amarrés}} au 'Port de la Lune'

# moonHarborShortStatus
source: {count} {count, plural, =1 {ship is} other {ships are}} currently in Bordeaux
es: {count} {count, plural, =1 {barco está actualmente} other {buques están actualmente}} en Bordeaux
fr: {count} {count, plural, =1 {navire est actuellement} other {navires sont actuellement}} à Bordeaux

# daySmall
source: d
fr: j

# errorScreenContentError
source: Error
fr: Erreur
